tap 'anomalyco/tap', trusted: true
tap 'bajankristof/tap', trusted: true
tap 'bufbuild/buf', trusted: true
tap 'common-fate/granted', trusted: true
tap 'hashicorp/tap', trusted: true

# Shell
brew 'asdf'
brew 'bash'
brew 'starship'
brew 'stow'

# Neovim
brew 'nvim'
brew 'fd'
brew 'fzf'
brew 'ripgrep'
brew 'tree-sitter'
brew 'tree-sitter-cli'

# Tools
brew 'awscli'
brew 'btop'
brew 'bufbuild/buf/buf', trusted: true
brew 'difftastic'
brew 'duckdb'
brew 'go'
brew 'go-air'
brew 'goose'
brew 'gopls'
brew 'common-fate/granted/granted', trusted: true
brew 'hashicorp/tap/packer', trusted: true
brew 'hashicorp/tap/terraform', trusted: true
brew 'hashicorp/tap/terraform-ls', trusted: true
brew 'helm'
brew 'httpie'
brew 'jq'
brew 'lua-language-server'
brew 'luarocks'
brew 'anomalyco/tap/opencode', trusted: true
brew 'sqlc'
brew 'tealdeer'
brew 'terragrunt'
brew 'yq'
brew 'zoxide'

# Goodies
brew 'bajankristof/tap/hopkey', trusted: true

# Libraries
brew 'libyaml' # ruby-lsp dependency

# Casks
cask 'dotnet-sdk'
cask 'font-jetbrains-mono-nerd-font'
cask 'ghostty'
